app/controllers/application_controller.rb

SELECT "puppies".* FROM "puppies" WHERE "puppies"."id" = ? LIMIT ?  [["id", 68], ["LIMIT", 1]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."puppy_id" = ?  [["puppy_id", 68]]
SELECT "posts".* FROM "posts" WHERE "posts"."puppy_id" = ?  [["puppy_id", 96]]
---
    def index
        if !session['logged_in?'] == true
            redirect_to("/login")
        end
        puppy = Puppy.find(session[:user_id])
        @posts = []
        puppy.friendships.each do |friendship|
            @posts << Post.where(puppy_id: friendship.friend_id)

SELECT "puppies".* FROM "puppies" WHERE "puppies"."email" = ? LIMIT ?  [["email", "alexvancap@gmail.com"], ["LIMIT", 1]]
INSERT INTO "puppies" ("name", "breed", "age", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        if !Puppy.find_by({email: params[:email]})
            if params[:password] == params[:repeated_password]
                Puppy.create(allowed_params)

SELECT "puppies".* FROM "puppies" WHERE "puppies"."email" = ? LIMIT ?  [["email", "bobby@puppy.com"], ["LIMIT", 1]]
---
    def login
        puppy = Puppy.find_by({email: params[:email]})