app/controllers/posts_controller.rb

    def like
        post = Post.find(params[:id])
        likes = post.likes + 1
        post.update({likes: likes})
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 42], ["LIMIT", 1]]
UPDATE "posts" SET "likes" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["likes", 2], ["updated_at", "2019-12-04 23:40:28.329130"], ["id", 42]]