app/controllers/puppies_controller.rb

SELECT "puppies".* FROM "puppies" WHERE "puppies"."email" = ? LIMIT ?  [["email", "alexvancap@gmail.com"], ["LIMIT", 1]]
---
    def create
        if !Puppy.find_by({email: params[:puppy][:email]})