app/controllers/puppies_controller.rb

    def show
        if !session['logged_in?']
            redirect_to("/login")
        else
            @puppy = Puppy.find(params[:id])
---
SELECT "puppies".* FROM "puppies" WHERE "puppies"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]

    def friends
        if !session['logged_in?']
            redirect_to("/login")
        else
            @puppy = Puppy.find(session[:user_id])
---
SELECT "puppies".* FROM "puppies" WHERE "puppies"."id" = ? LIMIT ?  [["id", 118], ["LIMIT", 1]]

    def unfriend
        if !session['logged_in?']
            redirect_to("/login")
        else
            matchup = Friendship.find_by({puppy_id: params[:id], friend_id: params[:friend_id]})
            Friendship.destroy(matchup.id)
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."puppy_id" = ? AND "friendships"."friend_id" = ? LIMIT ?  [["puppy_id", 46], ["friend_id", 47], ["LIMIT", 1]]
DELETE FROM "friendships" WHERE "friendships"."id" = ?  [["id", 20]]

    def edit_profile_controller
        if !session['logged_in?']
            redirect_to("/login")
        else
            user = Puppy.find(params[:id])
---
SELECT "puppies".* FROM "puppies" WHERE "puppies"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]